IoTReady/low-power-nrf52-weighing-scale/firmware/codebase/hal/hal_nop_delay.h
/**
 *  hal_nop_delay.h : HAL delays with NOP
 *  Copyright (C) 2019  Appiko
 */
/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

#ifndef CODEBASE_HAL_HAL_NOP_DELAY_H_
#define CODEBASE_HAL_HAL_NOP_DELAY_H_

/**
 * @addtogroup group_hal
 * @{
 *
 * @defgroup group_NOP_delay Delay with NOPs
 * @brief Hardware abstraction layer creating us and ms delay using the processor's NOP instruction.
 * @warning These functions are power hungry and keeps the processor busy.
 *  Use them for initial prototypes and seldom in production code.
 * @{
 */

#include "stdint.h"
#include "nrf.h"

/**
 * @brief Create a delay in micro-seconds with processor NOP instruction.
 * @param number_of_us The number of us of the delay
 */
static void hal_nop_delay_us(uint32_t number_of_us)
{
register uint32_t delay __ASM ("r0") = number_of_us;
__ASM volatile (
#ifdef NRF51
        ".syntax unified\n"
#endif
    "1:\n"
    " SUBS %0, %0, #1\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
#if defined NRF52 || defined NRF52832 || defined NRF52810
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
    " NOP\n"
#endif
    " BNE 1b\n"
#ifdef NRF51
    ".syntax divided\n"
#endif
    : "+r" (delay));
}

/**
 * @brief Create a delay in milli-seconds with processor NOP instruction.
 * @param number_of_ms The number of ms of the delay
 */
static inline void hal_nop_delay_ms(uint32_t number_of_ms)
{
    hal_nop_delay_us(1000*number_of_ms);
}

#endif /* CODEBASE_HAL_HAL_NOP_DELAY_H_ */

/**
 * @}
 * @}
 */
